[
  {
    "image": "https://logo.clearbit.com/whatsapp.com",
    "title": "WhatsApp",
    "companyName": "Meta Platforms",
    "id": 1,
    "description": "WhatsApp revolutionizes global communication by offering secure messaging and calling capabilities that connect billions of users worldwide. This comprehensive platform supports multiple communication formats including text messaging, high-quality voice calls, crystal-clear video calls, seamless document sharing, and dynamic group chats, all protected by industry-leading end-to-end encryption. Users can share photos, videos, and documents up to 2GB in size, making it ideal for both personal and professional use. The platform's Status feature allows users to share temporary updates with contacts, while broadcast lists enable sending messages to multiple recipients simultaneously. WhatsApp Web and Desktop applications ensure seamless synchronization across devices, allowing users to continue conversations whether on mobile, tablet, or computer. The app supports over 60 languages and works on various network conditions, including 2G networks, ensuring accessibility for users in diverse regions. Business features include WhatsApp Business API for large enterprises and WhatsApp Business app for small businesses, enabling customer service, automated responses, and catalog sharing. Location sharing, voice notes, and disappearing messages add layers of functionality and privacy. The platform's commitment to privacy means no ads, no tracking, and messages that stay between sender and recipient, making WhatsApp the trusted choice for secure, reliable communication across personal, professional, and business contexts worldwide.",
    "size": 45,
    "reviews": "120M",
    "ratingAvg": 4.5,
    "downloads": "7B",
    "ratings": [
      { "name": "1 star", "count": 6000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 81000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/tiktok.com",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 2,
    "description": "TikTok stands as the world's leading creative video-sharing platform, revolutionizing how users create, discover, and engage with short-form video content. The app empowers creators with an extensive suite of editing tools, including thousands of filters, effects, and augmented reality features that transform ordinary moments into captivating content. Its sophisticated algorithm learns user preferences to deliver a personalized 'For You' page that keeps viewers engaged for hours. Music integration is at TikTok's core, with millions of licensed tracks, sound effects, and original audio clips that users can incorporate into their videos. The platform's duet and stitch features enable collaborative content creation, fostering a global community of creators who build upon each other's ideas. TikTok's live streaming capabilities allow real-time interaction between creators and audiences, with virtual gifts and monetization options for eligible creators. The app supports videos from 15 seconds to 10 minutes, accommodating various content formats from quick comedy sketches to detailed tutorials. Educational content thrives on the platform through #LearnOnTikTok, while businesses leverage TikTok for Marketing to reach younger demographics. The Creator Fund and brand partnerships provide income opportunities for content creators. With trending challenges, viral dances, and cultural movements originating daily, TikTok has become a powerful force in shaping global pop culture, music trends, and social conversations.",
    "size": 90,
    "reviews": "95M",
    "ratingAvg": 4.6,
    "downloads": "3B",
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 62000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/facebook.com",
    "title": "Facebook",
    "companyName": "Meta Platforms",
    "id": 3,
    "description": "Facebook remains the world's largest social networking platform, connecting billions of people with friends, family, communities, and businesses across the globe. Users can share diverse content including status updates, photos, videos, live streams, and stories that disappear after 24 hours. The platform's Groups feature brings together people with shared interests, from local community organizations to global movements, with options for public, closed, or secret group settings. Facebook Pages enable businesses, organizations, celebrities, and brands to establish an official presence, share updates, and engage with followers through posts, events, and messaging. The Marketplace feature transforms Facebook into a local buying and selling platform where users can discover, buy, and sell items within their communities. Facebook Events helps users organize and discover local happenings, from intimate gatherings to large-scale festivals. The platform's powerful advertising system allows businesses of all sizes to reach targeted audiences based on demographics, interests, and behaviors. Facebook Watch offers original video content and shows, while Facebook Gaming provides a dedicated space for game streaming and esports content. Integration with Instagram and WhatsApp creates a seamless ecosystem for cross-platform sharing. Privacy controls allow users to customize who sees their content, with features like friend lists, privacy checkups, and activity logs. The platform continuously evolves with features like Facebook Dating, fundraisers for charitable causes, and crisis response tools.",
    "size": 80,
    "reviews": "110M",
    "ratingAvg": 4.3,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 7000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 9000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 64000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/instagram.com",
    "title": "Instagram",
    "companyName": "Meta Platforms",
    "id": 4,
    "description": "Instagram has evolved into a comprehensive visual storytelling platform where users share photos, videos, reels, and stories while connecting with creators and discovering trending content from around the world. The platform's Reels feature competes directly with TikTok, offering short-form video content with music, effects, and creative tools that help users express themselves in engaging ways. Instagram Stories provides ephemeral content that disappears after 24 hours, enhanced with interactive stickers, polls, questions, and music integration. The main feed showcases carefully curated photos and videos, with powerful editing tools and filters that have defined modern mobile photography aesthetics. IGTV and Instagram Live enable longer-form video content and real-time broadcasting, perfect for tutorials, performances, and authentic connections with audiences. The Explore page uses sophisticated algorithms to surface personalized content based on user interests and engagement patterns. Instagram Shopping transforms the platform into a visual marketplace where businesses can tag products directly in posts and stories, enabling seamless discovery and purchase. Creator tools include insights, branded content partnerships, and monetization features through badges and subscriptions. The platform's Direct Messages support text, voice, video calls, and disappearing messages with end-to-end encryption. Instagram's influence extends beyond social networking to shape fashion trends, travel destinations, food culture, and artistic movements globally.",
    "size": 70,
    "reviews": "105M",
    "ratingAvg": 4.4,
    "downloads": "4B",
    "ratings": [
      { "name": "1 star", "count": 6000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 22000000 },
      { "name": "5 star", "count": 65000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/telegram.org",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 5,
    "description": "Telegram stands out as a powerful messaging platform that prioritizes speed, security, and functionality with its cloud-based infrastructure enabling seamless synchronization across unlimited devices. The app supports massive group chats of up to 200,000 members, making it ideal for large communities, organizations, and public discussions. Telegram Channels provide a broadcasting tool for unlimited audiences, perfect for news outlets, content creators, and businesses to share updates with subscribers. The platform's bot ecosystem is unparalleled, with programmable bots offering everything from games and polls to payment processing and customer service automation. Secret Chats feature client-to-client encryption with self-destruct timers, screenshot alerts, and forward restrictions for ultimate privacy. File sharing capabilities are exceptional, supporting documents up to 2GB each with no compression, making it a favorite among professionals and students. The platform's cloud storage means users can access their complete message history and shared files from any device instantly. Telegram's open API and protocol encourage third-party development, resulting in numerous custom clients and integrations. Voice and video calls support both one-on-one and group conversations with screen sharing capabilities. Animated stickers, custom themes, and chat folders enhance user experience and organization. The platform operates without ads and promises to remain free forever, funded by optional premium subscriptions that unlock additional features like faster downloads, larger file uploads, and exclusive stickers.",
    "size": 60,
    "reviews": "85M",
    "ratingAvg": 4.7,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 60000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/snapchat.com",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 6,
    "description": "Snapchat pioneered ephemeral messaging and continues to innovate in augmented reality, creative communication, and authentic social sharing. The app's signature disappearing messages, photos, and videos create a pressure-free environment where users can be themselves without worrying about permanent digital footprints. Snapchat's AR Lenses are industry-leading, using advanced facial recognition and world tracking to overlay interactive 3D effects, transforming users into characters, adding virtual objects to real environments, and creating shareable moments of joy and creativity. The Snap Map feature lets friends share their location and discover what's happening around the world through location-based stories and heat maps of activity. Discover section provides a curated feed of content from publishers, creators, and brands, featuring original shows, news, and entertainment formatted specifically for mobile viewing. Snapchat's Spotlight showcases the best user-generated content with a TikTok-like vertical feed that can earn creators real money based on engagement. Chat 2.0 supports text, voice, and video calling with group functionality, plus unique features like voice and video notes. Memories allow users to save and organize their favorite snaps and stories in a private, searchable collection. The platform's commitment to privacy includes default deletion of messages, notification of screenshots, and no public likes or comments. Snapchat+ subscription service offers exclusive features like custom app icons, story rewatch indicators, and early access to new features.",
    "size": 85,
    "reviews": "78M",
    "ratingAvg": 4.2,
    "downloads": "3B",
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 48000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/spotify.com",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 7,
    "description": "Spotify revolutionized music streaming with its vast library of over 100 million songs, 5 million podcasts, and 350,000 audiobooks available at users' fingertips. The platform's sophisticated recommendation algorithm powers personalized playlists like Discover Weekly, Release Radar, and Daily Mix, introducing users to new music tailored to their tastes while celebrating their favorites. Collaborative playlists enable friends to build soundtracks together, while Spotify's social features let users see what friends are playing and share music directly through the app. The platform's podcast integration has transformed it into an audio entertainment hub, featuring exclusive shows from top creators and celebrities. Spotify Connect seamlessly transfers playback between devices, from phones to smart speakers, cars, TVs, and gaming consoles. The free tier offers ad-supported streaming with limitations, while Premium unlocks unlimited skips, offline downloads, and higher quality audio up to 320kbps. Spotify for Artists provides musicians with detailed analytics, promotional tools, and direct fan engagement opportunities. The platform's Wrapped feature has become a cultural phenomenon, providing users with personalized year-end statistics about their listening habits. Canvas adds looping video backgrounds to tracks, while Lyrics feature provides real-time synchronized lyrics. Spotify's algorithms also power DJ feature, an AI-powered personal DJ that provides commentary and music selection. The platform supports multiple languages and is available in over 180 markets worldwide.",
    "size": 100,
    "reviews": "92M",
    "ratingAvg": 4.8,
    "downloads": "2.5B",
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 12000000 },
      { "name": "5 star", "count": 73000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/netflix.com",
    "title": "Netflix",
    "companyName": "Netflix Inc.",
    "id": 8,
    "description": "Netflix dominates the streaming entertainment landscape with its extensive library of movies, TV shows, documentaries, and acclaimed original content that has redefined how the world consumes visual media. The platform's original productions, from blockbuster series like Stranger Things to Oscar-winning films, have established Netflix as a major force in content creation, competing with traditional Hollywood studios. The service's sophisticated recommendation system analyzes viewing habits to suggest personalized content, with percentage match scores indicating compatibility with user preferences. Multiple user profiles within a single account allow family members to maintain separate viewing histories and recommendations, while Kids profiles provide a safe, curated environment for younger viewers. Netflix's download feature enables offline viewing on mobile devices, perfect for travel or areas with limited connectivity. The platform supports streaming in multiple qualities from standard definition to 4K Ultra HD with HDR, automatically adjusting based on internet speed to ensure smooth playback. Interactive content like Bandersnatch and gaming experiences expand beyond traditional passive viewing. Netflix's global reach means content from around the world, with subtitles and dubbing in numerous languages, exposing viewers to international cinema and series. The service regularly refreshes its catalog, adding new content daily while producing hundreds of original titles annually. Features like Skip Intro, playback speed control, and smart downloads enhance the viewing experience.",
    "size": 120,
    "reviews": "87M",
    "ratingAvg": 4.6,
    "downloads": "2B",
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 2500000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 14000000 },
      { "name": "5 star", "count": 62000000 }
    ]
  },
  {
    "image": "https://www.google.com/images/branding/product/2x/maps_96in128dp.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 9,
    "description": "Google Maps serves as the world's most comprehensive navigation and location platform, offering real-time GPS navigation, live traffic updates, and detailed information about millions of places worldwide. The service provides turn-by-turn directions for driving, walking, cycling, and public transit, with voice guidance available in multiple languages. Live traffic data helps users avoid congestion with automatic rerouting suggestions and accurate arrival time predictions. Street View offers immersive 360-degree imagery of locations around the globe, allowing virtual exploration of destinations before visiting. The platform's extensive business listings include reviews, photos, hours of operation, contact information, and popular times to help users make informed decisions. Indoor maps for airports, malls, and stadiums provide detailed floor plans and directory information. Google Maps' offline functionality allows downloading map areas for navigation without internet connectivity. The Explore feature suggests nearby restaurants, attractions, and events based on user preferences and current location. Integration with other Google services enables features like saving places to lists, sharing locations in real-time with contacts, and timeline tracking of visited places. For businesses, Google My Business integration allows owners to manage their presence, respond to reviews, and share updates. Environmental features include eco-friendly route options that minimize fuel consumption and carbon footprint. Augmented reality navigation overlays directions on real-world imagery through Live View.",
    "size": 75,
    "reviews": "95M",
    "ratingAvg": 4.7,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 13000000 },
      { "name": "5 star", "count": 74000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/youtube.com",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 10,
    "description": "YouTube stands as the world's largest video platform, hosting billions of hours of content ranging from entertainment and education to news and personal vlogs, fundamentally changing how people create, share, and consume video content globally. The platform empowers creators with monetization opportunities through advertising revenue, channel memberships, Super Chat, and merchandise shelf integration. YouTube Shorts competes with TikTok by offering vertical short-form videos with creation tools, music library, and viral potential. The subscription feed keeps users updated with latest uploads from their favorite channels, while sophisticated algorithms recommend personalized content based on viewing history and engagement patterns. YouTube Premium offers ad-free viewing, background play, offline downloads, and access to YouTube Music's extensive catalog. Live streaming capabilities support everything from gaming broadcasts to educational seminars and global events with real-time chat interaction. YouTube TV provides cable replacement with live TV channels and cloud DVR functionality. The platform's Creator Studio offers comprehensive analytics, content management, and community engagement tools. Educational content thrives through YouTube Learning initiatives, with full courses and tutorials from prestigious institutions and expert instructors. YouTube Kids provides a safer environment for children with parental controls and age-appropriate content. Community features include posts, polls, and stories that enable creator-audience interaction beyond video comments.",
    "size": 110,
    "reviews": "130M",
    "ratingAvg": 4.6,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 99000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/x.com",
    "title": "X (Twitter)",
    "companyName": "X Corp",
    "id": 11,
    "description": "X, formerly Twitter, remains a central hub for real-time global conversations, breaking news, and public discourse where users can post thoughts, follow interests, and engage with a diverse community of voices from around the world. The platform's signature format of concise posts, now expandable beyond the traditional 280 characters for premium users, encourages quick, impactful communication that can spark movements, shape public opinion, and deliver news as it happens. Trending topics and hashtags surface important conversations and events, making X an essential tool for journalists, politicians, celebrities, and activists to reach audiences directly. The retweet and quote tweet features enable content to spread virally, amplifying voices and messages across the network. Spaces provides live audio conversations where users can host or join discussions on various topics with thousands of participants. Lists help users organize accounts by theme or interest, creating customized feeds for specific content. The platform's verification system, now available through X Premium subscription, offers blue checkmarks along with features like edit button, longer posts, and reduced ads. Direct Messages support private conversations with text, images, and videos. X's role in breaking news, crisis communication, and social movements has made it indispensable for staying informed about world events. The platform continues evolving with features aimed at creator monetization and long-form content support.",
    "size": 95,
    "reviews": "75M",
    "ratingAvg": 4.2,
    "downloads": "2B",
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 14000000 },
      { "name": "5 star", "count": 49000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/pinterest.com",
    "title": "Pinterest",
    "companyName": "Pinterest Inc.",
    "id": 12,
    "description": "Pinterest serves as a visual discovery engine where millions of users find and save creative ideas spanning fashion, recipes, home design, DIY projects, travel destinations, and countless lifestyle inspirations that transform browsing into actionable planning. The platform's unique pinboard system allows users to organize discoveries into themed boards, creating personalized collections that serve as mood boards, project planners, and wish lists. Visual search technology, including Lens camera search, enables users to find similar items, recipes, or styles by photographing real-world objects. The home feed uses machine learning to surface personalized recommendations based on saved pins and board activity, constantly introducing fresh ideas aligned with user interests. Shopping features have transformed Pinterest into a powerful e-commerce platform where users can discover and purchase products directly from Pins, with price tracking and availability notifications. Try On feature uses augmented reality for virtual makeup testing, while Shop the Look identifies and links multiple products within fashion and home decor pins. Business accounts access analytics, advertising tools, and rich Pins that automatically sync information from websites. Idea Pins (formerly Story Pins) allow creators to share multi-page videos and images with detailed instructions, ingredients lists, and supplies needed for projects. The platform's positive, aspirational environment focuses on future planning rather than past sharing, making it unique among social platforms.",
    "size": 70,
    "reviews": "50M",
    "ratingAvg": 4.7,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 35500000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/linkedin.com",
    "title": "LinkedIn",
    "companyName": "Microsoft",
    "id": 13,
    "description": "LinkedIn stands as the world's premier professional networking platform, connecting over 900 million members for career development, business opportunities, industry insights, and professional relationship building across every sector and geographic region. The platform's job search functionality is unparalleled, with personalized job recommendations, easy apply features, salary insights, and company research tools that help candidates find ideal opportunities while enabling recruiters to identify top talent through sophisticated search filters and InMail messaging. LinkedIn Learning offers thousands of professional courses taught by industry experts, covering technical skills, business strategy, creative tools, and personal development with certificates of completion that can be displayed on profiles. The news feed combines professional updates, thought leadership articles, and industry news, fostering meaningful discussions and knowledge sharing among professionals. Company Pages provide businesses with tools to showcase culture, share updates, post jobs, and build brand awareness among potential customers and employees. LinkedIn's publishing platform allows members to share long-form articles, establishing thought leadership and expertise in their fields. Sales Navigator and Recruiter products offer advanced tools for sales professionals and talent acquisition teams. The platform's messaging system supports professional communication with smart replies and voice messages. Groups bring together professionals with shared interests for discussion, networking, and knowledge exchange.",
    "size": 85,
    "reviews": "40M",
    "ratingAvg": 4.4,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 30000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/reddit.com",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 14,
    "description": "Reddit, self-proclaimed as the front page of the internet, hosts thousands of communities called subreddits where passionate users engage in discussions about literally every conceivable topic, from mainstream interests to the most niche hobbies imaginable. The platform's democratic voting system allows users to upvote or downvote content and comments, ensuring the best contributions rise to prominence while low-quality posts fade away. Ask Me Anything (AMA) sessions bring celebrities, experts, and interesting individuals directly to the community for unfiltered Q&A sessions that have become cultural events. Reddit's anonymous nature encourages honest discussions and authentic sharing of experiences, creating spaces for support, advice, and connection that might not exist elsewhere. The platform's influence on internet culture is immense, with memes, trends, and movements often originating from Reddit before spreading across the web. Moderation is community-driven, with volunteer moderators maintaining subreddit rules and culture, creating diverse environments from strictly academic discussions to casual humor. Reddit Gold/Premium offers ad-free browsing, exclusive features, and access to private subreddits. The platform's API has spawned numerous third-party apps and tools. Live streaming through Reddit Public Access Network (RPAN) adds real-time interaction. Reddit's role in significant events, from coordinating charitable efforts to influencing financial markets, demonstrates its power as a collective force.",
    "size": 60,
    "reviews": "35M",
    "ratingAvg": 4.3,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 27000000 }
    ]
  },
  {
    "image": "https://logo.clearbit.com/amazon.com",
    "title": "Amazon Shopping",
    "companyName": "Amazon",
    "id": 15,
    "description": "Amazon Shopping revolutionized e-commerce by offering an unparalleled selection of millions of products across every category imaginable, from everyday essentials to rare collectibles, all accessible through a seamlessly integrated mobile shopping experience. Prime membership unlocks free two-day, one-day, or even same-day delivery on eligible items, along with exclusive deals, early access to lightning deals, and special shopping events like Prime Day. The app's sophisticated recommendation engine analyzes browsing and purchase history to suggest relevant products, while customer reviews and ratings from millions of verified purchasers help inform buying decisions. Price tracking tools, including price drop notifications and price history charts, ensure users get the best deals. Subscribe & Save program offers discounts on regular deliveries of household essentials. Amazon's augmented reality View in Your Room feature lets shoppers visualize furniture and decor in their space before purchasing. The platform's comprehensive return policy and A-to-Z Guarantee provide purchase protection and peace of mind. Integration with Alexa enables voice shopping and order tracking. Amazon Fresh and Whole Foods integration brings grocery delivery to the app. The camera search feature allows finding products by scanning barcodes or taking photos. Gift options include registries, wish lists, and easy gifting with message cards. Amazon Pay extends secure payment beyond Amazon. Customer service chatbot and human support resolve issues quickly.",
    "size": 130,
    "reviews": "95M",
    "ratingAvg": 4.8,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 78000000 }
    ]
  }
]
